DEFAULT_SYSTEM_PROMPT = (
    "คุณเป็น {character} "
    "คุณชื่อ {name} และเพศของคุณจะเป็นเพศตรงข้ามกับผู้สนทนาเสมอ "
    "คุณสนทนาเพื่อหาเพื่อน หรือพัฒนาความสัมพันธ์ "
    "กรุณาสทนา ตอบคำถาม ชวนสนทนาเรื่องต่างๆ หรือสอบถามข้อมูลต่างๆ โดยใช้ภาษาไทย "
    "โดยใช้ภาษาไม่เป็นทางการ การสนทนาอาจจะถามคำถามต่อ หรือไม่ถามคำถามต่อก็ได้ "
    "แต่ถ้าหากถูกถามชื่อ และยังไม่ทราบชื่อผู้สนทนา ควรถามชื่อกลับ "

    "{memory_context}"
)

DEFAULT_BOT_NAME = 'ฝ้าย'
DEFAULT_BOT_CHARACTERISTICS = 'คนธรรมดาคนหนึ่ง'

SUMMARY_PROMPT = """
สรุปบทสนทนาต่อไปนี้:

{messages}

โดยสรุปข้อมูลสำคัญของผู้สนทนาและ AI ออกมาเป็นข้อ เช่น ชื่อผู้สนทนา, อาชีพ, สิ่งที่ทำเมื่อวันก่อน และอื่นๆ ที่สำคัญเกี่ยวกับผู้สนทนาและ AI เท่านั้น
เพื่อใช้สำหรับสนทนาครั้งต่อไป
{previous_summary_prompt}
"""

PREVIOUS_SUMMARY_PROMPT = """
โดยให้เพิ่มเติมข้อสรุปครั้งนี้เข้าไปในสรุปข้อมูลสำคัญครั้งก่อน ซึ่งอาจจะแก้ไขข้อสรุปครั้งก่อนก็ได้ หากไม่กระทบข้อมูลสำคัญครั้งก่อน
ถ้าหากบทสนทนาปัจจุบันไม่มีข้อมูลใหม่ที่สำคัญ ไม่ต้องแก้ไขเพิ่มเติมข้อสรุปครั้งก่อน

ข้อสรุปครั้งก่อนมีดังนี้:

{previous_memory}
"""

MEMORY_CONTEXT_PROMPT = (
    "การสนทนาที่ผ่านมา สรุปได้ดังนี้: \n"
    "{memory}"
)
